package Enum;

import java.util.ArrayList;
import java.util.List;

//동
public enum Village {
    초기화값("0",""),
    가정동("3020012600","가정동"),
    갑동("3020011800","갑동"),
    계산동("3020010600", "계산동"),
    관평동("3020014600","관평동"),
    교촌동("3020010200","교촌동"),
    구룡동("3020015300", "구룡동"),
    구성동("3020012400", "구성동"),
    구암동("3020011200","구암동"),
    궁동("3020012200", "궁동"),
    금고동("3020014800", "금고동"),
    금탄동("3020015000", "금탄동"),
    노은동("3020011900", "노은동"),
    대동("3020014900", "대동"),
    대정동("3020010300", "대정동"),
    덕명동("3020011300", "덕명동"),
    덕진동("3020013100", "덕진동"),
    도룡동("3020012700", "도룡동"),
    둔곡동("3020015200", "둔곡동"),
    문지동("3020014000", "문지동"),
    반석동("3020013900", "반석동"),
    방동("3020011000", "방동"),
    방현동("3020012900", "방현동"),
    복용동("3020011600", "복용동"),
    봉명동("3020011100", "봉명동"),
    봉산동("3020014500", "봉산동"),
    상대동("3020011500", "상대동"),
    성북동("3020010700", "성복동"),
    세동("3020010800","세동"),
    송강동("3020014700", "송강동"),
    송정동("3020010900", "송정동"),
    수남동("3020013600","수남동"),
    신동("3020015100", "신동"),
    신봉동("3020013500", "신봉동"),
    신성동("3020012500", "신성동"),
    안산동("3020013700", "안산동"),
    어은동("3020012300", "어은동"),
    외삼동("3020013800","외삼동"),
    용계동("3020010400", "용계동"),
    용산동("3020014400", "용산동"),
    원내동("3020010100", "원내동"),
    원신흥동("3020011400", "원신흥동"),
    원촌동("3020014200", "원촌동"),
    자운동("3020013400", "자운동"),
    장대동("3020011700", "장대동"),
    장동("3020012800", "장동"),
    전민동("3020014100", "전민동"),
    죽동("3020012100", "죽동"),
    지족동("3020012000", "지족동"),
    추목동("3020013300", "추목동"),
    탑립동("3020014300", "탑립동"),
    하기동("3020013200", "하기동"),
    학하동("3020010500", "학하동"),
    화암동("3020013000", "화암동") ;

    private final String code;
    private final String name;
    Village(String code, String name) {
        this.code = code;
        this.name = name;
    }

    public String getCode() {
        return code;
    }

    public String getName() {
        return name;
    }

    public static List<Village> getList(){
        List<Village> villageList = new ArrayList<Village>();
        for(Village village : values()){
            villageList.add(village);
        }
        return villageList;
    }
}
